%P74_1_1.m

clear;clc;format long;
%------------------- 线性插值 -------------------%
X1 = [0.5,0.6];
Y1 = [-0.693147,-0.510826];
L_x = lagrange_interpolation(X1,Y1);
disp('使用线性插值计算的ln0.54的近似值：');
lnx = polyval(L_x,0.54)
disp('ln0.54的实际值：');
LNX = log(0.54)
disp('线性插值的误差：');
div1 = abs(lnx-LNX)
%------------------- 线性插值 -------------------%


%------------------- 二次插值 -------------------%
X1 = [0.5,0.6,0.7];
Y1 = [-0.693147,-0.510826,-0.356675];
L_x = lagrange_interpolation(X1,Y1);
disp('使用二次插值计算的ln0.54的近似值：');
lnx = polyval(L_x,0.54)
disp('ln0.54的实际值：');
LNX = log(0.54)
disp('二次插值的误差：');
div2 = abs(lnx-LNX)
%------------------- 二次插值 -------------------%